# pandas

pandas is the primary module of interest for this course, as it provides data processing and analysis functionality for data in many forms. In addition, pandas offers two additional data structures, the **Series** and the **DataFrame**, that are built leverage much of the most useful functionality from lists, dictionaries, and Numpy ndarrays.

Similar to our NumPy class, we will focus today on:

* Creating Series and DataFrame objects
* Getting familiar with Series and DataFrame methods
    - Indexing, slicing, and filtering
    - Mathematical operations
    - Sorting and ranking
    - Function application and mapping

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame#series is one dimention pandas dataframe

## Creating Series and DataFrame objects

Similar to NumPy, most often, we will import our data into **Series** and **DataFrame** objects from another source; but for now, we will create them manually by casting from other appropriate data types.

### Series

**Series** objects are very similar to **ndarrays**...

* Indexing, slicing, filtering work in a similar way
* Easy and fast computation
* Concatenation

...with some additional features:

* An associated array of data labels, called an **index** object -- Index elements of a Series via positional indexing (as in an array) or via an index (similar to a dictionary key)
* Database-style merging

In [2]:
# Cast from another sequence object - list, tuple, or array
ser = Series([1,-2,3,-4])
ser

0    1
1   -2
2    3
3   -4
dtype: int64

In [3]:
# Basic indexing
ser[1]

-2

In [4]:
# Specify indices
ser = Series([1,-2,3,-4], index=['a','b','c','d'])
ser

a    1
b   -2
c    3
d   -4
dtype: int64

In [5]:
# Basic indexing - By index or position
print(ser.c, ser['c'], ser[2])#series will also be created altomatically

(3, 3, 3)

In [6]:
# Create from dictionary
D = {key:val for key,val in zip('abcd', [1,-2,3,-4])}
ser = Series(D)
ser

a    1
b   -2
c    3
d   -4
dtype: int64

In [7]:
# Drop values
ser.drop('c')#this will return a copy and will not change the original

a    1
b   -2
d   -4
dtype: int64

In [8]:
# Print Series
ser

a    1
b   -2
c    3
d   -4
dtype: int64

In [9]:
# Deleting values
del ser['c']#del will delete finally
ser

a    1
b   -2
d   -4
dtype: int64

Series objects have attributes that are similar dictionaries:

In [10]:
# Index object - similar to dictionary keys, returns an index array
ser.index#asky why and how to delete u？？？

Index([u'a', u'b', u'd'], dtype='object')

In [12]:
# Values - similar to dictionary values, returns an array
ser.values#what is the difference between array and series??

array([ 1, -2, -4])

In [11]:
# Check for membership
print('e' in ser.index)
print(-2 in ser.values)

False
True

### DataFrames

**DataFrames**, in their most basic form, are 2-dimensional data structures (rows and columns), and are similar in structure to a dictionary of Series objects (i.e., each Series is accessible via a column key). DataFrames can also represent higher dimensional data by leveraging *hierarchical indexing*.

Aside from loading data from a file directly into a DataFrame (later), the primary methods for creating a DataFrame are:

* From a dictionary of equal-length sequences or (any-length) Series objects
* From a 2-d array or sequence of equal-length sequences

In [13]:
# Dictionary of equal-length sequences
df = DataFrame({'a': [1,2,3], 'b': (4,5,6), 'c': np.array([7,8,9])}, index=[1,2,3])
df#equal lenth sequence, no matter what type sequence is it.

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [14]:
# Dictionary of Series objects
df = DataFrame({'Original': ser.append(Series({'e':5})), 'Negated': -ser})
#the ser is not modified, so when we add -ser it did not change
df#why floating??

   Negated  Original
a     -1.0         1
b      2.0        -2
d      4.0        -4
e      NaN         5

In [15]:
-ser

a   -1
b    2
d    4
dtype: int64

In [17]:
# 2-d array
df = DataFrame(np.random.rand(3,3), columns=['a','b','c'], index=[1,2,3])
df

          a         b         c
1  0.879819  0.860487  0.952974
2  0.298626  0.895109  0.532191
3  0.797967  0.187517  0.862785

DataFrames have similar attributes as Series objects:

In [18]:
# DataFrame index
df.index

Int64Index([1, 2, 3], dtype='int64')

In [19]:
# DataFrame columns
df.columns

Index([u'a', u'b', u'c'], dtype='object')

In [21]:
df.columns = ['3','4','5']
df

          3         4         5
1  0.879819  0.860487  0.952974
2  0.298626  0.895109  0.532191
3  0.797967  0.187517  0.862785

In [23]:
df.columns = ['a','b','c']
df

          a         b         c
1  0.879819  0.860487  0.952974
2  0.298626  0.895109  0.532191
3  0.797967  0.187517  0.862785

In [24]:
# DataFrame values
df.values

array([[ 0.87981896,  0.86048686,  0.95297369],
       [ 0.29862561,  0.8951092 ,  0.53219107],
       [ 0.79796732,  0.1875166 ,  0.86278519]])

Indexing DataFrames columns follows the general syntax:

```
df[column(s)]
```

In addition, there are .loc, .iloc, .at, and iat methods that allow you to access and update more specific information contained within the DataFrame. The .loc method accesses the [row(s), column(s)] data by index and column name. The .iloc method accesses the [row(s), column(s)] data by positional row and column indices. The .at and .iat methods select a single scalar value by index and position, respectively. The .ix method served a similar purpose as the .loc method, but will soon be deprecated so please avoid.

In [26]:
#dataframe is column index first!
# Basic column indexing
df['b'] # or df.b, only works if column name does not match a DataFrame method or have spaces

1    0.860487
2    0.895109
3    0.187517
Name: b, dtype: float64

In [29]:
df.b

1    0.860487
2    0.895109
3    0.187517
Name: b, dtype: float64

In [27]:
# Multiple columns
df[['a','c']]

          a         c
1  0.879819  0.952974
2  0.298626  0.532191
3  0.797967  0.862785

In [32]:
# Columns and rows
print(df[['a','b']].loc[[1,2]])#two writing methods
print(df.loc[[1,2],['a','b']])#what is the difference between series and dataframe??
#series looks like differently comparing to the dataframe
#if you print it it will looks different??

          a         b
1  0.490631  0.860487
2  0.298626  0.895109
          a         b
1  0.490631  0.860487
2  0.298626  0.895109

In [31]:
df.loc[[1,2],['a','b']]

          a         b
1  0.490631  0.860487
2  0.298626  0.895109

In [30]:
# Updating values using .loc
df.loc[1,'a'] = np.random.rand()
df

          a         b         c
1  0.490631  0.860487  0.952974
2  0.298626  0.895109  0.532191
3  0.797967  0.187517  0.862785

In [36]:
# .iloc method
df.iloc[:3, 2:]#iloc use the number of the columns while the loc use its name

          c         d
1  0.952974  0.160649
2  0.532191  0.932257
3  0.862785  0.635673

In [35]:
# .at method
df.at[1,'b']

0.86048686203364522

In [33]:
# Creating new columns - New value(s) will be broadcast (if applicable)
df['d'] = np.random.rand(3)
df

          a         b         c         d
1  0.490631  0.860487  0.952974  0.160649
2  0.298626  0.895109  0.532191  0.932257
3  0.797967  0.187517  0.862785  0.635673

In [37]:
# Creating new columns - Series
df['e'] = Series(np.random.rand(3), index=[1,2,4])#use index to specific which index to input
df#if we donot make a match, we will ignore the result and return NAN

          a         b         c         d         e
1  0.490631  0.860487  0.952974  0.160649  0.275446
2  0.298626  0.895109  0.532191  0.932257  0.596937
3  0.797967  0.187517  0.862785  0.635673       NaN

In [38]:
# Dropping rows
df.drop(2)#delete the row totally

          a         b         c         d         e
1  0.490631  0.860487  0.952974  0.160649  0.275446
3  0.797967  0.187517  0.862785  0.635673       NaN

In [39]:
# Dropping columns
df.drop('b', axis=1)#drop only delet for show

          a         c         d         e
1  0.490631  0.952974  0.160649  0.275446
2  0.298626  0.532191  0.932257  0.596937
3  0.797967  0.862785  0.635673       NaN

In [40]:
# Display df
df

          a         b         c         d         e
1  0.490631  0.860487  0.952974  0.160649  0.275446
2  0.298626  0.895109  0.532191  0.932257  0.596937
3  0.797967  0.187517  0.862785  0.635673       NaN

In [41]:
# Deleting columns
del df['e']
df

          a         b         c         d
1  0.490631  0.860487  0.952974  0.160649
2  0.298626  0.895109  0.532191  0.932257
3  0.797967  0.187517  0.862785  0.635673

### Filtering with Series and DataFrames

Similar to arrays, one of the primary techniques for filtering your data involves boolean arrays, which you can store as an array (to use multiple times) or apply inline (to use once). The key is that your boolean array must broadcast appropriately to the filtered object.

You can apply a filter to a Series, DataFrame column (which is also a Series), or a DataFrame, given the shape of the boolean array matches appropriately.

Comparisons for generating the boolean arrays can include:

* <, >, <=, >=, ==, !=
* in (membership) - also combine with not (not in)
* is (identity) - also combine with not (is not)
* .any(*axis*), .all(*axis*) where *axis* allows you to specify whether to aggregate across a row (1) or down a column (0)
* .isnull/.isna, .notnull/.notna methods (next)
* Vectorized string .is methods (later)
* Vectorized function applications (later)
* And more!

You can generate more complex comparisons using logical and, or, xor, or not operations:

* and, & (scalar) and np.logical_and (array)
* or, | (scalar) and np.logical_or (array)
* ^ (xor, scalar) and np.logical_xor (array)
* not (scalar), and np.logical_not (array)

You can also combine filtering with assignment, using the .loc method. Remember, the assigned object must broadcast appropriately to the filtered data structure. For example, a scalar will be broadcast to all values, a list or array dimensions must match appropriately, and a Series object must have the same indices (otherwise, you will get NaN).

In [42]:
# Column filter
df.loc[:, np.array([True,False,True,True])]#use array to filter

          a         c         d
1  0.490631  0.952974  0.160649
2  0.298626  0.532191  0.932257
3  0.797967  0.862785  0.635673

In [43]:
df.loc[:, [True,False,True,True]]#also can use list to filter

          a         c         d
1  0.490631  0.952974  0.160649
2  0.298626  0.532191  0.932257
3  0.797967  0.862785  0.635673

In [44]:
# Identify values greater than 0.5
mask = df > 0.5#boardcast
mask

       a      b     c      d
1  False   True  True  False
2  False   True  True   True
3   True  False  True   True

In [45]:
# Apply mask to DataFrame
df[mask]

          a         b         c         d
1       NaN  0.860487  0.952974       NaN
2       NaN  0.895109  0.532191  0.932257
3  0.797967       NaN  0.862785  0.635673

In [ ]:
# Apply any or all method to mask - down each column (axis=0), across each row (axis=1)
amask = mask.all(axis=0)
amask

In [ ]:
# Apply amask to DataFrame - must match dimensions
df.loc[:,amask]

In [ ]:
# Apply filter inline
df[df > 0.5]

In [47]:
# Apply filter based on column values
df['color'] = 'blue', 'green', 'blue'
print(df)
df[df['color'] == 'blue']#always use comparasing to filter the result

          a         b         c         d  color
1  0.490631  0.860487  0.952974  0.160649   blue
2  0.298626  0.895109  0.532191  0.932257  green
3  0.797967  0.187517  0.862785  0.635673   blue

          a         b         c         d color
1  0.490631  0.860487  0.952974  0.160649  blue
3  0.797967  0.187517  0.862785  0.635673  blue

In [48]:
# Apply filter to specific column
print(df['b'][df['color'] == 'green'])#comparing is like row slicing
print(df.loc[df['color'] == 'green', 'b'])#these two is equally

2    0.895109
Name: b, dtype: float64
2    0.895109
Name: b, dtype: float64

In [49]:
df.loc[df['color'] == 'green', 'b']

2    0.895109
Name: b, dtype: float64

In [50]:
# Combine filtering with assignment
df.loc[df['color'] == 'green', 'b'] = np.random.rand()
df

          a         b         c         d  color
1  0.490631  0.860487  0.952974  0.160649   blue
2  0.298626  0.665219  0.532191  0.932257  green
3  0.797967  0.187517  0.862785  0.635673   blue

### Descriptive Statistics

Similar to arrays, there are many built-in functions and methods for computing descriptive statistics on Series and DataFrame objects:

* .count
* .describe
* .min, .max
* .argmin, .argmax
* .idxmin, .idxmax
* .quantile
* .sum
* .mean
* .median
* .mad (mean absolute deviation)
* .prod
* .var
* .std
* .skew
* .kurt
* .cumsum
* .cummin, .cummax
* .cumprod
* .diff
* .pct_change

Some of this functions are aggregation functions and some are non-aggregation functions. In addition, many functions have an *axis* input that allows you to compute the function down a column (*axis* = 0) or across a row (*axis* = 1).

In addition, there are correlation and covariance methods:

* ser.corr or df.corr
* ser.cov or df.cov
* df.corrwith

And summary and comparison functions for categorical data:

* .unique (unique values)
* .value_counts (frequency summary)
* .isin (membership)

In [63]:
# Create series object
ser = Series(np.random.randn(100))

In [60]:
# .describe method
ser.describe()

count    100.000000
mean      -0.029919
std        1.019017
min       -2.620157
25%       -0.681207
50%       -0.023964
75%        0.647076
max        2.091158
dtype: float64

In [76]:
# Create DataFrame object
df = DataFrame(np.random.randn(100,3))
df.head()

          0         1         2
0 -0.207715 -0.753023 -1.321471
1 -1.452309 -1.347824  0.391955
2 -0.306699  0.188151 -1.221832
3  0.220796 -2.869629  0.570505
4 -0.481249  0.118498  0.359703

In [65]:
# Compute summary statistic across row (axis=1) or column (axis=0)
df.sum(axis=0)

0   -13.079452
1     2.269107
2    -5.939494
dtype: float64

In [66]:
df.sum(axis=1)

0    -2.007596
1     0.920777
2     2.979999
3    -0.118829
4     0.966472
5     0.391250
6    -0.543447
7    -0.591158
8    -1.385428
9    -0.954400
10   -2.362536
11    1.605878
12    0.919009
13    1.741389
14    1.327301
15    0.585489
16    0.121334
17    1.828908
18    2.229492
19    0.369767
20    0.389361
21   -1.732624
22   -1.946883
23    0.206949
24    2.035774
25   -1.959023
26   -1.207373
27   -0.560239
28    1.711352
29   -0.479100
        ...
70    3.053917
71   -0.939388
72    0.306846
73    1.046410
74   -3.393245
75   -0.818227
76    3.329132
77   -1.350711
78    0.240926
79    1.065289
80   -0.793327
81   -3.268252
82   -0.620502
83   -0.361202
84   -4.645685
85   -3.924782
86    1.973630
87   -0.402467
88   -0.175778
89    1.486121
90    1.146298
91   -2.808355
92   -0.795799
93   -0.620870
94    1.111783
95    2.232463
96    0.026111
97   -0.478614
98   -2.049032
99    2.832527
Length: 100, dtype: float64

In [67]:
# Correlation matrix
df.corr()#column relationship

          0         1         2
0  1.000000  0.037833 -0.068558
1  0.037833  1.000000  0.014458
2 -0.068558  0.014458  1.000000

In [68]:
# Create categorical series
cser = Series(['green'] * 20 + ['red'] * 25 + ['blue'] * 10)
cser.head()

0    green
1    green
2    green
3    green
4    green
dtype: object

In [70]:
cser.tail()

50    blue
51    blue
52    blue
53    blue
54    blue
dtype: object

In [71]:
# Unique values
cser.unique()

array(['green', 'red', 'blue'], dtype=object)

In [72]:
# Value counts
cser.value_counts()

red      25
green    20
blue     10
dtype: int64

In [74]:
# Membership#is in function!
cser.isin(['green','red']).sum()

45

### Arithmetic Operations and Data Alignment

Similar to arrays, arithmetic operations (and comparisons) involving Series and DataFrame objects are flexible. The interpreter will attempt to broadcast scalars and sequences to the appropriate Series and DataFrame dimensions (if possible).

However, for arithmetic operations (and comparisons) strictly involving Series and/or DataFrame objects, the interpreter will match the indices of the objects and perform the operation between matching elements (i.e., those with the same index *and* column). This process is called *data alignment* and is an important aspect of working with pandas data structures. Operations involving entries (indices) that exist in one object and not in the other will result in NaN. To get around this issue, you can make sure beforehand that the indices match, or you perform the operation by casting to an array.

In [77]:
# Create Series objects
ser1 = Series([1,2,3])#the default index starts from 0
ser2 = Series([1,2,3], index=[1,2,3])
DataFrame({'1': ser1, '2': ser2})#it will concate by index

     1    2
0  1.0  NaN
1  2.0  1.0
2  3.0  2.0
3  NaN  3.0

In [78]:
# Arithmetic between Series and scalar
ser1 + 5#boardcast

0    6
1    7
2    8
dtype: int64

In [80]:
# Arithmetic between Series and sequence
ser1 + np.array([10,20,30]) # works for list and tuples too

0    11
1    22
2    33
dtype: int64

In [81]:
# Arithmetic between two Series objects
ser1 + ser2#also by index

0    NaN
1    3.0
2    5.0
3    NaN
dtype: float64

In [82]:
# Arithmetic methods - .add, .sub, .div, .floordiv, .mul, .pow
ser1.add(ser2, fill_value=0)#nan fill by 0

0    1.0
1    3.0
2    5.0
3    3.0
dtype: float64

In [83]:
# Create two DataFrames
df1 = DataFrame(np.random.rand(3,3))
df1

          0         1         2
0  0.161399  0.652312  0.069346
1  0.490777  0.706505  0.429166
2  0.117734  0.833327  0.243406

In [84]:
df2 = DataFrame(np.random.rand(3,3), index=[1,2,3], columns=[1,2,3])
df2

          1         2         3
1  0.646268  0.864899  0.733662
2  0.845073  0.837532  0.174570
3  0.399924  0.806719  0.418921

In [85]:
# Perform operation between DataFrames
df1 + df2

    0         1         2   3
0 NaN       NaN       NaN NaN
1 NaN  1.352772  1.294065 NaN
2 NaN  1.678400  1.080938 NaN
3 NaN       NaN       NaN NaN

In [87]:
df1

          0         1         2
0  0.161399  0.652312  0.069346
1  0.490777  0.706505  0.429166
2  0.117734  0.833327  0.243406

In [88]:
df2

          1         2         3
1  0.646268  0.864899  0.733662
2  0.845073  0.837532  0.174570
3  0.399924  0.806719  0.418921

In [86]:
# Perform operation between DataFrame values
DataFrame(df1.values + df2.values)#will add everthing ignore the index difference

          0         1         2
0  0.807666  1.517210  0.803008
1  1.335850  1.544037  0.603736
2  0.517658  1.640046  0.662327

### Function Application and Mapping

Similar to arrays, Series and DataFrames support fast comparison and computation operations. NumPy universal functions (e.g., np.abs, np.square, np.log, np.exp, etc.) work as expected (for both Series and DataFrame objects with numerical data).

However, there are many operations that we would like to apply that do not have built in functions or methods. Here is where our lambda functions come in handy, but we can use fully defined functions as well. There are three primary methods for applying custom functions to Series or DataFrame objects:

* Series .map method - Applies function to each element in Series
* DataFrame .apply method - Applies function column- or row-wise
* DataFrame .applymap method - Applies function to each element in DataFrame

In [89]:
# Apply NumPy universal function
df = DataFrame(np.random.rand(3,5))
print(df)
np.exp(df)#numpy function works for dataframe

          0         1         2         3         4
0  0.409419  0.595559  0.876505  0.601272  0.541007
1  0.434494  0.976284  0.052586  0.606704  0.584904
2  0.504226  0.632615  0.882890  0.883839  0.884787

          0         1         2         3         4
0  1.505942  1.814045  2.402488  1.824437  1.717736
1  1.544182  2.654573  1.053993  1.834375  1.794818
2  1.655703  1.882528  2.417877  2.420172  2.422468

In [90]:
# Series map method - Numerical computation
ser = Series(np.random.rand(10))
print(ser)
ser.map(lambda x: x ** 2)

0    0.303881
1    0.059998
2    0.387387
3    0.784641
4    0.819013
5    0.111423
6    0.890996
7    0.679395
8    0.801910
9    0.787490
dtype: float64

0    0.092344
1    0.003600
2    0.150068
3    0.615662
4    0.670782
5    0.012415
6    0.793873
7    0.461578
8    0.643060
9    0.620141
dtype: float64

In [96]:
ser=Series({1: 'The Green Mile', 2: 'Black Panther', 3: 'The Bourne Identity'})

In [97]:
ser.map(lambda s: len(s.split()))#count for the lenth of the titles

1    3
2    2
3    3
dtype: int64

In [91]:
# Series .map method - String operation
Series({1: 'The Green Mile', 2: 'Black Panther', 3: 'The Bourne Identity'}).map(lambda s: len(s.split()))

1    3
2    2
3    3
dtype: int64

In [ ]:
#stop here??

In [98]:
# DataFrame .apply method - down each column (axis=0), across each row (axis=1)
print(df)
print(df.apply(lambda arr: arr / arr.sum(), axis=1))

          0         1         2         3         4
0  0.409419  0.595559  0.876505  0.601272  0.541007
1  0.434494  0.976284  0.052586  0.606704  0.584904
2  0.504226  0.632615  0.882890  0.883839  0.884787
          0         1         2         3         4
0  0.135400  0.196960  0.289872  0.198849  0.178919
1  0.163653  0.367719  0.019807  0.228516  0.220305
2  0.133099  0.166989  0.233054  0.233304  0.233554

In [93]:
# DataFrame .applymap method
df.applymap(lambda arr: arr / df.sum().sum())

          0         1         2         3         4
0  0.043247  0.062908  0.092584  0.063512  0.057146
1  0.045895  0.103124  0.005555  0.064086  0.061783
2  0.053261  0.066823  0.093259  0.093359  0.093459

### Sorting and Ranking

Oftentimes, you will want to sort your Series or DataFrame objects according to some of the contained data. The primary method for sorting is:
```
ser.sort_values(ascending=True/False)
df.sort_values(by=column(s), ascending=True/False)
```

To re-sort your data structure into its original form, use the sort.index method.

Alternatively, you can determine the rank of each value using the .rank method.

In [ ]:
# Sort series
ser.sort_values(ascending=True)

In [ ]:
# Sort DataFrame
df.sort_values(by=1, ascending=False)

In [ ]:
# Rank method - by column (axis=0), by row (axis=1)
df.rank(axis=0, method='average', ascending=True) # method = 'average', 'min', 'max', 'first', 'dense'

## Next Time: Data Import and Export